import React from "react";
import { MapContainer, TileLayer, Popup, GeoJSON } from "react-leaflet";
import dcr from "../data/draft/DunavChernoMore2.json";
import ict from "../data/draft/IronCurtainTrail10.json";
import draft from "../data/draft/draft.json";

export default function Map() {
  return (
    <>
      <div className="map_container">
        <MapContainer center={[42.705, 25.09]} zoom={7.4} scrollWheelZoom={false}>
          <TileLayer
            attribution='&copy; <a href="https://www.openstreetmap.org/copyright">OpenStreetMap</a> contributors'
            url="https://{s}.tile.openstreetmap.org/{z}/{x}/{y}.png"
          />
          <GeoJSON data={dcr.features} style={{ color: "#325da8" }}>
            <Popup>EuroVelo 6 - Atlantic Ocean - Black Sea</Popup>
          </GeoJSON>
          <GeoJSON data={ict.features} style={{ color: "#32a852" }}>
            <Popup>EuroVelo 13 - Iron Curtain Trail</Popup>
          </GeoJSON>
          <GeoJSON
            data={draft.features}
            style={{ color: "#ed7d40", opacity: 0.5, weight: 10 }}
          >
            <Popup>Национален велосипеден маршрут</Popup>
          </GeoJSON>
        </MapContainer>
      </div>
      <div className="block_offset">
        <h2 className="heading">Концепция за национална мрежа от велосипедни маршрути</h2>
        <div className="text text_column">
        Създаването на мрежа от национални велосипедни маршрути в България има за цел да определи основни направления за развитие на велосипедни маршрути, които да свързват страната в посока север-юг и запад-изток. Изборът на направление се характеризира със следните особености:
        <ul>
          <li>създаване на възможност за преминаване с велосипед през територията на страната за пътуващи от и към съседни на България страни;</li>
          <li>свързване на националните маршрути с маршрутите на съседните страни;</li>
          <li>свързване на участъците на ЕвроВело маршрут 13, където той преминава в съседни страни, така че да се получи непрекъснат национален маршрут;</li>
          <li>създаване на възможност за бъдещо свързване на участъци от националните маршрути чрез регионални и местни маршрути;</li>
          <li>свързване на големите населени места, в които се генерират основните туристически потоци, с туристическите дестинации, където се концентрират забележителностите и предлагането на туристически услуги;</li>
          <li>съобразяване с релефа и други географски условия на страната, така че да се избегнат прекалено дълги и стръмни изкачвания, като същевременно маршрутите придобият тематичност основана на концепцията за туристическо райониране на България;</li>
          <li>съобразяване с железопътната мрежа на страната, което да подобри достъпността на маршрутите и да осигури алтернативно придвижване в случай на необходимост.</li>
        </ul>
        Първоначалното определяне на велосипедните маршрути от перспективата на международното и националното равнище позволява да се избегне разпокъсано възникване на местни и регионални маршрути, което впоследствие трудно би могло да се обособи като пълноценна йерархична мрежа. Същевременно, такова определяне налага огромна по обем работа, ако крайната му цел трябва да бъде детайлно определяна на всички трасета. Затова като основен резултат на настоящата концепция трябва да се разглежда определянето на основните направления, които да бъдат следвани за определянето на национални велосипедни маршрути. Определянето на конкретните трасета следва да отчита редица съображения на местно равнище при планирането, изграждането на необходимата инфраструктура и реализирането на маршрутите като краен продукт.
        </div>
      </div>
    </>
  );
}
